Python 3.8.3 (tags/v3.8.3:6f8c832, May 13 2020, 22:20:19) [MSC v.1925 32 bit (Intel)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> def Calc(quan,price):
	return quan * price

>>> def Run():
	while True:
		q = int(input('กรุณากรอกจำนวนสินค้า:'))
		p = int(input('กรุณากรอกราคาสินค้า:'))
		result = Calc(q,p)
		print(f'สินค้ารวมราคาทั้งหมด: {result} บาท')
		print('--------')

		
>>> Run()
กรุณากรอกจำนวนสินค้า:5
กรุณากรอกราคาสินค้า:100
สินค้ารวมราคาทั้งหมด: 500 บาท
--------
กรุณากรอกจำนวนสินค้า:7
กรุณากรอกราคาสินค้า:16
สินค้ารวมราคาทั้งหมด: 112 บาท
--------
กรุณากรอกจำนวนสินค้า:10
กรุณากรอกราคาสินค้า:45
สินค้ารวมราคาทั้งหมด: 450 บาท
--------
กรุณากรอกจำนวนสินค้า:89
กรุณากรอกราคาสินค้า:100
สินค้ารวมราคาทั้งหมด: 8900 บาท
--------
กรุณากรอกจำนวนสินค้า:152
กรุณากรอกราคาสินค้า:321
สินค้ารวมราคาทั้งหมด: 48792 บาท
--------
กรุณากรอกจำนวนสินค้า:
Traceback (most recent call last):
  File "<pyshell#11>", line 1, in <module>
    Run()
  File "<pyshell#10>", line 3, in Run
    q = int(input('กรุณากรอกจำนวนสินค้า:'))
KeyboardInterrupt
>>> def Run():
	while True:
		q = int(input('กรุณากรอกจำนวนสินค้า:'))
		p = int(input('กรุณากรอกราคาสินค้า:'))
		result = Calc(q,p)
		print(f'สินค้ารวมราคาทั้งหมด: {result:,d} บาท')
		print('--------')

		
>>> Run()
กรุณากรอกจำนวนสินค้า:1520
กรุณากรอกราคาสินค้า:458
สินค้ารวมราคาทั้งหมด: 696,160 บาท
--------
กรุณากรอกจำนวนสินค้า:50
กรุณากรอกราคาสินค้า:432
สินค้ารวมราคาทั้งหมด: 21,600 บาท
--------
กรุณากรอกจำนวนสินค้า: