Python 3.8.3 (tags/v3.8.3:6f8c832, May 13 2020, 22:20:19) [MSC v.1925 32 bit (Intel)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> def Thai5000bath(work):
	if work == 'โปรแกรมเมอร์':
		print('คุณเขียนโปรแกรมได้ หาเงินเองได้ ไม่มีสิทธิ์รับ')
	elif work == 'เกษตรกร':
		print('คุณเลี้ยงปลาได้ ปลูกผักเองได้')
	else:
		print('รอการตรวจสอบ')

		
>>> Thai5000bath('โปรแกรมเมอร์')
คุณเขียนโปรแกรมได้ หาเงินเองได้ ไม่มีสิทธิ์รับ
>>> Thai5000bath('เกษตรกร')
คุณเลี้ยงปลาได้ ปลูกผักเองได้
>>> Thai5000bath('นักการเมือง')
รอการตรวจสอบ
>>> def Thai5000bath(work):
	allwork = ['โปรแกรมเมอร์','เกษตรกร','รับจ้าง','ขายของ']
	if work in allwork:
		print('คุณไม่ได้รับสิทธิ์ เสียใจด้วย')
	else:
		print('รอการอนุมัติ')

		
>>> Thai5000bath('โปรแกรมเมอร์')
คุณไม่ได้รับสิทธิ์ เสียใจด้วย
>>> Thai5000bath('นักการเมือง')
รอการอนุมัติ
>>> 